Repository: apps3k-com/CodingBuddy
Catalog: CodingBuddy/Localizable.xcstrings
Source language: en
Languages: de

source: Token saved
de: Token gespeichert

source: Token update failed
de: Token-Aktualisierung fehlgeschlagen

source: Token values are masked until you authenticate.
de: Token-Werte bleiben maskiert, bis du dich authentifizierst.

source: Try a different check, status, source, or remediation.
de: Versuche eine andere Prüfung, einen anderen Status, eine andere Quelle oder Behebung.

source: Try a different file, warning, or path.
de: Versuche es mit einer anderen Datei, Warnung oder einem anderen Pfad.

source: Try a different owner, name, or description.
de: Versuche es mit einem anderen Owner, Namen oder einer anderen Beschreibung.

source: Try a different server, tool, repository, scope, or environment variable name.
de: Versuche es mit einem anderen Server, Tool, Repository, Scope oder Environment-Variable-Namen.

source: Try a different server, tool, scope, or environment variable name.
de: Versuche es mit einem anderen Server, Tool, Scope oder Environment-Variable-Namen.

source: Try a different source, backup file, target path, or status.
de: Versuche eine andere Quelle, Backup-Datei, einen anderen Zielpfad oder Status.

source: Try a different title, branch, issue, status, or author.
de: Versuche einen anderen Titel, Branch, Issue, Status oder Autor.

source: Unexpected
de: Unerwartet

source: Unexpected file type
de: Unerwarteter Dateityp

source: Unknown
de: Unbekannt

source: Unlock to view and edit
de: Zum Ansehen und Bearbeiten entsperren

source: Unsupported backup
de: Nicht unterstütztes Backup

source: Until CodingBuddy quits
de: Bis CodingBuddy beendet wird

source: View Credential Files…
de: Anmeldedatendateien anzeigen…

source: View the selected credential files
de: Die ausgewählten Anmeldedatendateien anzeigen

source: Updated
de: Aktualisiert

source: Use ＋ to add your first variable.
de: Mit ＋ legst du die erste Variable an.

source: Use a fine-grained personal access token with read-only Metadata, Pull requests, Issues, Checks, and Commit statuses permissions.
de: Verwende einen feingranularen Personal Access Token mit Nur-Lese-Berechtigungen für Metadata, Pull requests, Issues, Checks und Commit statuses.

source: Use Manual Entry
de: Manuelle Eingabe verwenden

source: Used by Agent PR Monitor to read pull request, issue, check, and review status from GitHub.
de: Wird vom Agent PR Monitor verwendet, um Pull-Request-, Issue-, Check- und Review-Status von GitHub zu lesen.

source: Used when CodingBuddy opens Markdown, JSON, YAML, and other text files from repository tools.
de: Wird verwendet, wenn CodingBuddy Markdown, JSON, YAML und andere Textdateien aus Repository-Tools öffnet.

source: User
de: Benutzer

source: Value
de: Wert

source: Values that look like secrets (TOKEN, KEY, PASSWORD, …) are masked until you authenticate with Touch ID or your password.
de: Werte, die wie Secrets aussehen (TOKEN, KEY, PASSWORD, …), bleiben maskiert, bis du dich mit Touch ID oder Passwort authentifizierst.

source: Values with command substitution ($(…) or `…`) are not supported.
de: Werte mit Command Substitution ($(…) oder `…`) werden nicht unterstützt.

source: View Files…
de: Dateien ansehen…

source: Visible to child processes (export)
de: Für Kindprozesse sichtbar (export)

source: Waiting
de: Wartet

source: Warning
de: Warnung

source: Watched repositories
de: Überwachte Repositories

source: Watched repository
de: Überwachtes Repository

source: Author
de: Autor

source: Configuration
de: Konfiguration

source: Configured
de: Konfiguriert

source: Environment
de: Umgebung

source: Health & Security
de: Zustand & Sicherheit

source: Linked Issues
de: Verknüpfte Issues

source: Maintenance
de: Wartung

source: Missing variables
de: Fehlende Variablen

source: Open Source
de: Quelle öffnen

source: Open the selected finding's tool
de: Tool des ausgewählten Befunds öffnen

source: Open the selected source file
de: Ausgewählte Quelldatei öffnen

source: Repo readiness guidance consequence failure
de: Dieser Zustand kann zuverlässige Arbeit blockieren oder Mitwirkende und Coding-Agenten ohne eine erforderliche Absicherung lassen, bis er behoben ist.

source: Repo readiness guidance consequence pass
de: Diese Prüfung ist unauffällig und erhöht derzeit nicht die Unsicherheit bei Repository-Einrichtung oder Arbeitsablauf.

source: Repo readiness guidance consequence warning
de: Das teilweise oder mehrdeutige Signal kann zu unterschiedlichen Annahmen bei Mitwirkenden und Coding-Agenten führen, bis es geprüft wurde.

source: Repo readiness guidance no action expected result
de: Diese Readiness-Prüfung bleibt unauffällig.

source: Repo readiness guidance no action reason
de: Das Repository enthält derzeit das für diese Prüfung erwartete Signal.

source: Repo readiness guidance no action title
de: Keine Aktion nötig

source: Repo readiness guidance relevance build and test documentation
de: Dokumentierte Befehle machen die Validierung wiederholbar und reduzieren Vermutungen darüber, wie das Repository gebaut und getestet wird.

source: Repo readiness guidance relevance CI workflow
de: CI liefert vor dem Merge ein unabhängiges Build- oder Testergebnis.

source: Repo readiness guidance relevance contribution workflow
de: Ein dokumentierter Contribution-Ablauf hält Issue-, Branch-, Review- und Validierungsschritte konsistent.

source: Repo readiness guidance relevance feature flag documentation
de: Die Feature-Flag-Dokumentation zeigt, welches Verhalten von einem Flag gesteuert wird, wie ausgereift es ist und wie die Einführung abläuft.

source: Repo readiness guidance relevance GitHub templates
de: Issue- und Pull-Request-Vorlagen bewahren den Kontext, den Umsetzende und Prüfende für wiederholbare Übergaben benötigen.

source: Repo readiness guidance relevance governance
de: Repository-spezifische Agent-Anweisungen definieren Zuständigkeiten, Sicherheitsregeln und Validierungserwartungen, bevor Codeänderungen beginnen.

source: Repo readiness guidance relevance readme
de: Eine README gibt Mitwirkenden und Coding-Agenten einen gemeinsamen Ausgangspunkt für Zweck und Einrichtung des Projekts.

source: Repo readiness guidance relevance repository state
de: Marker für Git-Operationen können auf einen unterbrochenen oder laufenden Vorgang hinweisen, der vor neuen Änderungen verstanden werden sollte.

source: Repo readiness guidance relevance setup and hooks
de: Ein leicht auffindbarer Einrichtungsweg hilft, lokale Prüfungen und Git-Hooks für alle Mitwirkenden konsistent auszuführen.

source: Repo readiness guidance reveal repository expected result
de: Das ausgewählte Repository wird im Finder geöffnet, damit du seine Dateien prüfen oder bearbeiten kannst.

source: Subject
de: Betreff

source: %@ was not found. Choose its executable in Settings.
de: %1$@ wurde nicht gefunden. Wähle das Programm in den Einstellungen aus.

source: All
de: Alle

source: Automatic
de: Automatisch

source: Available
de: Verfügbar

source: Cancelled
de: Abgebrochen

source: Change the filter or search text.
de: Ändere den Filter oder den Suchtext.

source: Choose Executable
de: Programm auswählen

source: Choose %@ executable
de: %1$@-Programm auswählen

source: Choose…
de: Auswählen…

source: Choose the %@ executable.
de: Wähle das %1$@-Programm aus.

source: CodingBuddy cannot update this installation without additional permissions.
de: CodingBuddy kann diese Installation ohne zusätzliche Rechte nicht aktualisieren.

source: CodingBuddy could not read the %@ package list.
de: CodingBuddy konnte die %1$@-Paketliste nicht lesen.

source: Compatible
de: Kompatibel

source: Direct
de: Direkt

source: Executable path for %@
de: Programmpfad für %1$@

source: Dependency
de: Abhängigkeit

source: Install a supported package manager or choose its executable in Settings.
de: Installiere einen unterstützten Paketmanager oder wähle sein Programm in den Einstellungen aus.

source: Installed
de: Installiert

source: Latest
de: Neueste

source: Leave a path empty to use automatic discovery. CodingBuddy never starts a login shell or requests administrator privileges.
de: Lass einen Pfad leer, um die automatische Erkennung zu verwenden. CodingBuddy startet nie eine Login-Shell und fordert keine Administratorrechte an.

source: Major update
de: Hauptversions-Update

source: Manager
de: Paketmanager

source: No matching packages
de: Keine passenden Pakete

source: No packages found
de: Keine Pakete gefunden

source: No release notes available
de: Keine Versionshinweise verfügbar

source: No target version is available for this package.
de: Für dieses Paket ist keine Zielversion verfügbar.

source: No version-specific release notes found
de: Keine versionsspezifischen Hinweise gefunden

source: Not started
de: Nicht gestartet

source: Not writable
de: Nicht beschreibbar

source: Open Release Notes
de: Versionshinweise öffnen

source: Package manager executables
de: Paketmanager-Programme

source: Package type
de: Pakettyp

source: Pinned
de: Angeheftet

source: Pinned packages must be unpinned in Homebrew before they can be updated.
de: Angeheftete Pakete müssen zuerst in Homebrew gelöst werden, bevor sie aktualisiert werden können.

source: Queued
de: In Warteschlange

source: Release Notes
de: Versionshinweise

source: Review selected package updates
de: Ausgewählte Paket-Updates prüfen

source: Run Updates
de: Updates ausführen

source: Reset %@ executable
de: %1$@-Programmpfad zurücksetzen

source: Running
de: Läuft

source: Scan all package managers
de: Alle Paketmanager prüfen

source: Scanning package managers…
de: Paketmanager werden geprüft …

source: Search packages
de: Pakete durchsuchen

source: Self-updating
de: Aktualisiert sich selbst

source: Stop
de: Stoppen

source: Stop before the next package starts
de: Vor dem Start des nächsten Pakets stoppen

source: Succeeded
de: Erfolgreich

source: The command could not be started.
de: Der Befehl konnte nicht gestartet werden.

source: The command failed with exit code %lld.
de: Der Befehl ist mit Exit-Code %lld fehlgeschlagen.

source: The command timed out.
de: Der Befehl hat das Zeitlimit überschritten.

source: The command was cancelled.
de: Der Befehl wurde abgebrochen.

source: The executable is unavailable: %@
de: Das Programm ist nicht verfügbar: %1$@

source: The executable path must be absolute.
de: Der Programmpfad muss absolut sein.

source: The package cannot be updated with %@.
de: Das Paket kann nicht mit %1$@ aktualisiert werden.

source: This cask updates itself and is not upgraded directly by CodingBuddy.
de: Dieses Cask aktualisiert sich selbst und wird nicht direkt von CodingBuddy aktualisiert.

source: Update Selected
de: Ausgewählte aktualisieren

source: Update available
de: Update verfügbar

source: Update log
de: Update-Protokoll

source: Update selected packages?
de: Ausgewählte Pakete aktualisieren?

source: Update target
de: Update-Ziel

source: Updated from %@ to %@.
de: Von %1$@ auf %2$@ aktualisiert.

source: Validating Homebrew updates
de: Homebrew-Updates werden geprüft

source: Updating…
de: Wird aktualisiert …

source: Alternative. Expected result: %@
de: Alternative. Erwartetes Ergebnis: %@

source: Alternatives
de: Alternativen

source: What could happen
de: Was passieren könnte

# Developer glossary ahead behind definition
source: Ahead counts local commits not on the remote branch; behind counts remote commits not in your local branch.
de: „Voraus“ zählt lokale Commits, die nicht im Remote-Branch vorhanden sind; „zurück“ zählt Remote-Commits, die im lokalen Branch fehlen.

# Developer glossary ahead behind title
source: Ahead/behind
de: Commits voraus/zurück

# Developer glossary CI definition
source: Continuous integration (CI) automatically builds and tests code changes.
de: Continuous Integration (CI) erstellt und testet Codeänderungen automatisch.

# Developer glossary direct dependency definition
source: A direct dependency is a package you explicitly installed or declared, rather than one required by another package.
de: Eine direkte Abhängigkeit ist ein Paket, das du selbst installiert oder angegeben hast, statt eines Pakets, das nur von einem anderen Paket benötigt wird.

# Developer glossary direct dependency title
source: Direct dependency
de: Direkte Abhängigkeit

# Developer glossary dirty worktree definition
source: A dirty worktree has local file changes that have not been committed.
de: Ein Worktree mit lokalen Änderungen enthält Dateiänderungen, die noch nicht in einem Commit gespeichert wurden.

# Developer glossary dirty worktree title
source: Dirty worktree
de: Worktree mit lokalen Änderungen

# Developer glossary MCP definition
source: The Model Context Protocol (MCP) lets AI tools connect to external tools and data sources.
de: Das Model Context Protocol (MCP) verbindet KI-Tools mit externen Tools und Datenquellen.

# Developer glossary OAuth definition
source: OAuth lets an app access another service with your approval without sharing your password.
de: OAuth erlaubt einer App mit deiner Zustimmung den Zugriff auf einen anderen Dienst, ohne dein Passwort weiterzugeben.

# Developer glossary package pin definition
source: A package pin keeps a package at its current version until the pin is removed.
de: Ein Paket-Pin hält ein Paket auf seiner aktuellen Version, bis der Pin entfernt wird.

# Developer glossary package pin title
source: Package pin
de: Paket-Pin

# Developer glossary PR definition
source: A pull request (PR) proposes code changes for review before they are merged.
de: Ein Pull Request (PR) schlägt Codeänderungen zur Prüfung vor, bevor sie zusammengeführt werden.

# Developer glossary scope definition
source: Scope describes a boundary: which permissions a login receives or where a setting applies.
de: Der Geltungsbereich beschreibt eine Grenze: welche Berechtigungen eine Anmeldung erhält oder wo eine Einstellung gilt.

# Developer glossary scope title
source: Scope
de: Geltungsbereich

source: Effort
de: Aufwand

source: Evidence
de: Nachweise

source: Expected result
de: Erwartetes Ergebnis

source: Glossary
de: Glossar

# Guidance effort high
source: High
de: Hoch

# Guidance effort low
source: Low
de: Niedrig

# Guidance effort medium
source: Medium
de: Mittel

# Guidance safety read only
source: Read-only
de: Nur-Lesezugriff

# Guidance safety requires confirmation
source: Requires confirmation
de: Bestätigung erforderlich

# Guidance safety reversible
source: Reversible
de: Rückgängig machbar

source: Recommended. Expected result: %@
de: Empfohlen. Erwartetes Ergebnis: %@

source: Recommended next step
de: Empfohlener nächster Schritt

source: Show or hide technical evidence and glossary definitions.
de: Technische Nachweise und Glossardefinitionen ein- oder ausblenden.

source: Technical details
de: Technische Details

source: Unavailable: %@
de: Nicht verfügbar: %@

source: What this means
de: Einfach erklärt

source: Why it matters
de: Warum wichtig

source: Add a fine-grained read-only token before CodingBuddy can rank pull request work.
de: Füge einen feingranularen Nur-Lese-Token hinzu, bevor CodingBuddy die Pull-Request-Arbeit priorisieren kann.

source: Attention inspector header accessibility label
de: %1$@, Pull Request %2$lld: %3$@. Priorität: %4$@.

source: Attention inspector recommended header accessibility label
de: Empfohlen. %1$@, Pull Request %2$lld: %3$@. Priorität: %4$@.

source: Attention priority act now
de: Jetzt

source: Attention priority act now explanation
de: Ein bestätigter Blocker benötigt Arbeit, oder CodingBuddy kann den aktuellen Repository-Status nicht verifizieren.

source: Attention priority next
de: Als Nächstes

source: Attention priority next explanation
de: Eine sinnvolle Folgeaktion ist verfügbar, aber es ist kein bestätigter unmittelbarer Blocker sichtbar.

source: Attention priority ready
de: Bereit

source: Attention priority ready explanation
de: Es ist kein bekannter Blocker sichtbar; dieser Pull Request bleibt für den Abschluss in der Liste.

source: Attention priority waiting
de: Warten

source: Attention priority waiting explanation
de: Ein anderer Prozess oder eine andere Person muss zuerst fertig werden, bevor eine weitere Aktion sinnvoll ist.

source: Attention Queue
de: Fokusliste

source: Attention queue unavailable
de: Fokusliste nicht verfügbar

source: Some repository snapshots are not current. Available repository status remains visible.
de: Einige Repository-Momentaufnahmen sind nicht aktuell. Der verfügbare Repository-Status bleibt sichtbar.

source: Attention reason changes requested
de: Änderungen wurden angefordert

source: Attention reason draft
de: Pull-Request-Entwurf

source: Attention reason failed CI
de: CI fehlgeschlagen

source: Attention reason GitHub access
de: GitHub-Zugriff ist nicht verfügbar

source: Attention reason rate limited
de: GitHub begrenzt Aktualisierungen

source: Attention reason ready
de: Bereit zum Abschließen

source: Attention reason refresh failed
de: Repository-Aktualisierung fehlgeschlagen

source: Attention reason refreshing
de: Repository wird aktualisiert

source: Attention reason unresolved findings
de: Review-Hinweise sind ungelöst

source: Attention reason waiting for CI
de: CI läuft noch

source: Attention reason waiting for review
de: Review steht noch aus

source: Attention reason waiting for signals
de: Readiness-Signale sind unvollständig

source: Choose a queue row to understand its priority and recommended next action.
de: Wähle einen Listeneintrag aus, um seine Priorität und die empfohlene nächste Aktion zu verstehen.

source: Choose repositories in Agent PR Monitor to build your attention queue.
de: Wähle im Agent PR Monitor Repositories aus, um deine Fokusliste zu erstellen.

source: CodingBuddy did not find open pull requests in the current repository snapshots.
de: CodingBuddy hat in den aktuellen Repository-Snapshots keine offenen Pull Requests gefunden.

source: Focus
de: Fokus

source: Loading attention queue...
de: Fokusliste wird geladen …

source: No pull requests need sorting
de: Keine Pull Requests müssen sortiert werden

source: No watched repositories
de: Keine beobachteten Repositories

source: Open PR Monitor
de: PR-Monitor öffnen

source: Open the full pull request monitor
de: Vollständigen Pull-Request-Monitor öffnen

source: Priority
de: Priorität

source: Recommended
de: Empfohlen

source: Refresh watched repositories
de: Beobachtete Repositories aktualisieren

source: Select a pull request
de: Pull Request auswählen

source: Why now
de: Warum jetzt

source: Agent PR guidance changes requested consequence
de: Der Pull Request bleibt blockiert, bis die gewünschten Änderungen umgesetzt und erneut geprüft wurden.

source: Agent PR guidance changes requested explanation
de: Für diesen Pull Request wurden Änderungen angefordert.

source: Agent PR guidance changes requested relevance
de: Die Review-Entscheidung verhindert derzeit die Freigabe des Pull Requests.

source: Agent PR guidance CI state evidence label
de: CI-Status

source: Agent PR guidance draft consequence
de: Der Pull Request bleibt blockiert, bis sein Entwurfsstatus auf GitHub geändert wird.

source: Agent PR guidance draft explanation
de: GitHub kennzeichnet diesen Pull Request als Entwurf.

source: Agent PR guidance draft relevance
de: Ein Entwurf ist noch nicht für den normalen Review- und Merge-Ablauf bereit.

source: Agent PR guidance failed CI consequence
de: Der Pull Request bleibt durch CI blockiert, bis der Fehler behoben oder der Check erneut ausgeführt wurde.

source: Agent PR guidance failed CI explanation
de: Mindestens ein sichtbarer CI-Check ist für diesen Pull Request fehlgeschlagen.

source: Agent PR guidance failed CI relevance
de: Fehlgeschlagene Checks können verhindern, dass der Pull Request bereit wird.

source: Agent PR guidance head SHA evidence label
de: Head-Commit

source: Agent PR guidance no action expected result
de: Der Pull Request bleibt unverändert.

source: Agent PR guidance no action title
de: Keine Aktion nötig

source: Agent PR guidance one unresolved finding explanation
de: Dieser Pull Request hat einen nicht gelösten Review-Befund.

source: Agent PR guidance open draft expected result
de: Der Pull Request wird im Browser geöffnet, damit du seinen Entwurfsstatus prüfen kannst.

source: Agent PR guidance open failed CI expected result
de: Der Pull Request wird im Browser geöffnet, damit du die fehlgeschlagenen Checks prüfen kannst.

source: Agent PR guidance open PR action title
de: Pull Request öffnen

source: Agent PR guidance open PR unavailable reason
de: Der Pull Request kann aus dieser Ansicht nicht geöffnet werden.

source: Agent PR guidance open requested changes expected result
de: Der Pull Request wird im Browser geöffnet, damit du die angeforderten Änderungen prüfen kannst.

source: Agent PR guidance open Settings action title
de: Einstellungen öffnen

source: Agent PR guidance open Settings expected result
de: Die Einstellungen werden geöffnet, damit du den gespeicherten GitHub-Token prüfen kannst.

source: Agent PR guidance open Settings unavailable reason
de: Die Einstellungen können aus dieser Ansicht nicht geöffnet werden.

source: Agent PR guidance open unresolved findings expected result
de: Der Pull Request wird im Browser geöffnet, damit du die nicht gelösten Befunde prüfen kannst.

source: Agent PR guidance PR number evidence label
de: Pull-Request-Nummer

source: Agent PR guidance readiness evidence label
de: Bereitschaft

source: Agent PR guidance ready consequence
de: Der Status kann sich durch neue Commits, Checks oder Reviews ändern.

source: Agent PR guidance ready explanation
de: Die sichtbaren CI-Checks sind grün und die Review-Signale zeigen keinen bekannten Blocker für diesen Pull Request.

source: Agent PR guidance ready no action reason
de: Auf Grundlage der sichtbaren CI- und Review-Signale ist keine Aktion nötig.

source: Agent PR guidance ready relevance
de: Nach dem aktuellen Snapshot braucht dieser Pull Request im Monitor keine weitere Aufmerksamkeit.

source: Agent PR guidance refresh action title
de: Aktualisieren

source: Agent PR guidance refresh expected result
de: CodingBuddy lädt einen neuen schreibgeschützten Pull-Request-Snapshot.

source: Agent PR guidance refresh unavailable reason
de: Während einer laufenden Aktualisierung ist keine weitere Aktualisierung möglich.

source: Agent PR guidance refreshing consequence
de: Kein Pull Request wird verändert, während CodingBuddy GitHub auf neuere Signale prüft.

source: Agent PR guidance refreshing explanation
de: CodingBuddy aktualisiert dieses Repository und hat seine aktuellen Pull-Request-Daten noch nicht bestätigt.

source: Agent PR guidance refreshing relevance
de: Die Fokusliste kann sich ändern, sobald die laufende schreibgeschützte Aktualisierung abgeschlossen ist.

source: Agent PR guidance repository evidence label
de: Repository

source: Agent PR guidance review state evidence label
de: Review-Status

source: Agent PR guidance stale authorization consequence
de: Pull-Request-Arbeit aus diesem Repository kann fehlen oder veraltet sein.

source: Agent PR guidance stale authorization explanation
de: CodingBuddy kann die aktuellen Pull-Request-Daten dieses Repositorys nicht bestätigen, weil die GitHub-Autorisierung geprüft werden muss.

source: Agent PR guidance stale authorization relevance
de: Bis die Autorisierung wieder funktioniert, kann die Fokusliste nicht bestätigen, welche Pull Requests geändert wurden oder Aufmerksamkeit brauchen.

source: Agent PR guidance stale rate limit consequence
de: Pull-Request-Arbeit aus diesem Repository bleibt unbestätigt, bis eine spätere Aktualisierung erfolgreich ist.

source: Agent PR guidance stale rate limit explanation
de: CodingBuddy kann die aktuellen Pull-Request-Daten nicht bestätigen, weil GitHub Anfragen vorübergehend begrenzt.
